_posts/2015-08-06-java-8-on-amazon-emr.html
---
layout: post
title: Java 8 on Amazon EMR
date: 2015-08-06
categories:
-
tags:
- java8
- EMR
- bootsrap action
author: vadali
excerpt: a bootstrap action for amazon EMR that installs java 8
---
<p>
Recently I needed to use a library requiring java 8 on a large hadoop
cluster running on Amazon EMR. I couldn't find any AMI's that has them
installed, so I rolled my own with some help from google.
</p>

<div class="org-src-container">
<label class="org-src-name">java8-bootstrap-action.sh:</label>
<pre class="src src-sh"><span class="org-comment-delimiter"># </span><span class="org-comment">Check java version</span>
<span class="org-variable-name">JAVA_VER</span>=$(java -version 2&gt;&amp;1 | sed <span class="org-string">'s/java version "\(.*\)\.\(.*\)\..*"/\1\2/; 1q'</span>)

<span class="org-keyword">if</span> [ <span class="org-string">"$JAVA_VER"</span> -lt 18 ]
<span class="org-keyword">then</span>
    <span class="org-builtin">echo</span> <span class="org-string">"Getting add-apt-repository"</span>
    wget --no-check-certificate --no-cookies <span class="org-string">"https://blog.anantshri.info/content/uploads/2010/09/add-apt-repository.sh.txt"</span> -O add-apt-repository.sh

    <span class="org-builtin">echo</span> <span class="org-string">"Adding oracle java ppa"</span>
    sudo sh add-apt-repository.sh ppa:webupd8team/java

    <span class="org-builtin">echo</span> <span class="org-string">"updating"</span>
    sudo apt-get update

    <span class="org-builtin">echo</span> <span class="org-string">"Setting up installation..."</span>
    <span class="org-builtin">echo</span> <span class="org-string">"oracle-java8-installer shared/accepted-oracle-license-v1-1 select true"</span> | sudo debconf-set-selections

    <span class="org-builtin">echo</span> <span class="org-string">"Installing..."</span>
    sudo apt-get install -y oracle-java8-installer

    <span class="org-builtin">echo</span> <span class="org-string">"Setting JAVA_HOME to java 8"</span>
    <span class="org-builtin">echo</span> <span class="org-string">'export JAVA_HOME=/usr/lib/jvm/java-8-oracle'</span> &gt; /home/hadoop/conf/hadoop-user-env.sh
<span class="org-keyword">fi</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">Check java version again</span>
<span class="org-variable-name">JAVA_VER</span>=$(java -version 2&gt;&amp;1 | sed <span class="org-string">'s/java version "\(.*\)\.\(.*\)\..*"/\1\2/; 1q'</span>)

<span class="org-builtin">echo</span> <span class="org-string">""</span>
<span class="org-builtin">echo</span> <span class="org-string">"Java version is $JAVA_VER!"</span>
<span class="org-builtin">echo</span> <span class="org-string">"JAVA_HOME: $JAVA_HOME"</span>
<span class="org-builtin">echo</span> <span class="org-string">"JRE_HOME: $JRE_HOME"</span>
<span class="org-builtin">echo</span> <span class="org-string">"PATH: $PATH"</span>
</pre>
</div>
